def get_data():
    data = '''69-地址报名可见,70-同步直播,71-票种-审核设置,72-隐藏为你推荐,73-联系主办方,74-H5页面模板,75-邀请报名,76-通知粉丝,77-渠道追踪,78-优惠码,79-邀请码,80-自定义邀请函,81-群发通知,82-添加名单,83-导出名单,84-邀请榜-查看数据,85-邀请榜-榜单展示开关,86-私域导流-点击保存并开启,87-电子票,88-自定义域名,89-开启隐藏,90-开启Paypal,91-隐私设置,92-申请,93-再申请一个,94-发短信,95-会员（打标、导入、导出）,96-全部导出,97-评价,98-回放,99-创建数藏,100-营销短信,101-多活动关联,102-素材库上传,103-素材库上传文件大于10G,104-添加协作用户,105-协作大于5'''
    return data


if __name__ == '__main__':
    datas = get_data()
    str_list = datas.split(',')
    # 打印排序后的数据
    for item in str_list:
        item_list = item.split('-')
        # print('<el-option label="'+item_list[1]+'" value="'+item_list[0]+'" />')
        print('case '+item_list[0]+':')
        print('  return "'+item_list[1]+'";')


